{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-4-100",
            "title": "Developing Learning Resources Based On Student Mindsets",
            "studentName": "Aylin Onalan",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "./posters/csse/onalan_aylinal_kim.png",
            "abstract": "For my capstone project, my primary objective was to conduct research on the skills and mindsets of undergraduate students at UW Bothell in the context of software engineering. After taking CSS 478: Usability and User-Centered Design and CSS 480: Principles of Human Computer Interaction, I became interested in the fields of usability and user experience. The CSS 390: Software Engineering (SES) course granted me the opportunity to use my previous experiences with usability and user experience to interview students on their software engineering skills and mindsets.\n\n Since SES is a newly offered course within the CSS department at UW Bothell, it continues to require the development of resources that will help its students gain a more real-world software engineering experience. My research consisted of surveying and conducting interviews with current and former SES students, as well as non-SES students. These helped us understand what areas students felt the curriculum could be improved to help prepare them for future internship and career opportunities.\n\n With the guidance and feedback from our advisors and a UW Bothell master’s student, I was able to help with the development of resources for the class by looking out for and sharing what areas students felt they could develop their skills and mindsets. By developing these resources, we hope to help future students at UW Bothell develop their software engineering skills and mindsets so that they are better prepared for future career opportunities. "
        },    
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-4-115",
            "title": "Developing Learning Resources Based On Student Mindsets",
            "studentName": "Nicola Mihai",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. David Socha",
            "posterLink": "./posters/csse/mihai_nicola.png",
            "abstract": "The focus of my work was primarily centered around students’ skills and mindsets as it relates to software engineering. The research goal was to first determine what students’ mindsets are with regards to software engineering work and then create learning resources based on this information. We were able to achieve this by using a combination of surveys and semi-structure interviews. We chose this type of approach as surveys allowed us to reach more students than we could have through simply interviewing, while semi-structured interviews allowed us to “customize” the interview by altering the direction as needed based upon responses we receive during the interview.\n\n The driving factor as to why I chose to work on this is that having taken numerous CSS courses, as well as CSS 390: Software Engineering Studio (SES), allowing me to experience the contrast between the “cookie cutter” approach for learning versus the “real world” and “hands on” approach offered by the SES course. The next logical step in the SES course’s approach to teaching was evident: identifying misconceptions in student mindsets and attempting to change them by creating resources that break down a task into smaller manageable chunks.\n\n Following this, we were able to have conversations about how students perceive certain topics as well as their approach to certain tasks and problems. Part of our result is the research findings, interview recordings, and survey results. The other part of our project consists of the resources that students will eventually use, the wiki pages. Our wiki pages on document smells will help students when they work on their SES badge portfolios, an assignment that SES course students complete several times throughout their time in the class. These pages focus on identifying, explaining, and showing document smells. Document smells are a concept that we define as a surface indication [within a document] that usually corresponds to a deeper problem. These are significant to the SES class as it allows them to create better portfolios and documents in general, which is a set of skills that they will carry on into other course work and their professional work. "
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-4-130",
            "title": "Making the WFE-Navigator System More Maintainable by Integrating Redux",
            "studentName": "Asher Dang",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. David Socha",
            "posterLink": "./posters/csse/dang_asher.jpg",
            "abstract": "Ethnography is the study of people and Wide-Field Ethnography(WFE) coined by Socha et al. is a variant that refers to “an approach of gathering and collaboratively analyzing large, multi-modal, multi-stream datasets of [physical-cyber-social systems] in action” (Socha, Adams, et al., 2016). Datasets gathered for WFE studies are high in volume, multi-modal, and multi-stream. The WFE-Navigator System is a tool designed by CSSE Master’s Student Irene Wachirawutthichai to simplify navigation over these large multi-modal, multi-stream datasets.\n\n For this project, I reorganized how data was moved through the app by integrating Redux into the Electron-React-Typescript Framework. By adding the redux system, I decoupled the data from the components by having a central redux store that stores all component data. This separates the component and data from each other. Gathering all component data in one place gives all components on any level the same level of access to the same data.\n\n As a benefit of integrating redux, a new file system is put in place for maintaining each component while also cutting down the repeated boilerplate code throughout the application. This also makes implementing added function such as “loading state from a configuration file” simpler as all app data is stored in one place. If other developers were to join this project, this change makes the code easier to understand and maintain for future development. "
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-4-145",
            "title": "Comfy Aquarium Game Pt.2",
            "studentName": "Varun Nadarajah",
            "studentMajor": "CSSE",
            "projectType": "Group Project: Student Defined",
            "facultyAdvisor": "Dr. David Socha",
            "posterLink": "./posters/csse/nadarajah_varun.png",
            "abstract": "Comfy Aquarium is a 2D idle-style IOS game designed for players to unwind and relieve stress. The app was built on the Unity game engine and scripted in C#, with fellow CSSE major Anthony Vu as co-developer. This project was done in conjunction with an Interactive Media Design (IMD) capstone group consisting of Spencer Jong, Hanyue Shi, and Spencer Pruitt, who provided all the designs, assets, and requirements for the game. They had created the initial designs for the game but were in need of developers to actualize it, which they enlisted us to do.\n\n The primary goal of this project was to implement the Comfy Aquarium game and meet the requirements of the IMD group within the one-quarter time constraint, while also practicing software engineering and game design principles to create an appealing and intuitive final product.\n\n At the end of the project, we were able to create a fully functional version of the game with the primary requested features implemented, such as the core pearl mechanics, fish shop, inventory, and decoration system. The app is compatible with both iPhone and iPad devices through its adaptive UI. There were some requested features, like the IOS home screen widget, that were not feasible to complete during the project.\n\n Through working on this project, I gained valuable experience working on a larger team project. I had to collaborate closely with co-developer Anthony Vu to properly implement different components of the game, as well as routinely meet and communicate with the IMD group to ensure we were on schedule and meeting their requirements. As we had minimal experience working with Unity at the beginning of the project, we struggled with how to organize ourselves and best implement features of the game. But by the end, I learned how to effectively utilize the features of Unity to implement our game, and acquired knowledge in game design through building modular and expandable components and getting user feedback to create an enjoyable and intuitive experience. "
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-4-200",
            "title": "Comfy Aquarium Game Pt.1",
            "studentName": "Anthony Vu",
            "studentMajor": "CSSE",
            "projectType": "Group Project: Student Defined",
            "facultyAdvisor": "Dr. David Socha",
            "posterLink": "./posters/csse/vu_anthony_congtien.png",
            "abstract": "omfy Aquarium is a 2D aquarium themed idle-stye IOS game development project that was built through the Unity game engine. It is a five-person project split into two groups of students, a CSSE group and an IMD (Interactive Media Design) group. The CSSE group was made up of myself (Anthony Vu) and Varun Nadarajah, and our job was to develop the game itself through code. As co-game developer I collaborated closely with Varun to implement the core gameplay mechanics and features. We worked together to code the various systems of the game such as the shop, gacha, and decor systems. The IMD group consisted of Hanyue Shi, Spencer Jong, and Spencer Pruitt. They introduced the idea of creating this game and their role was to provide us with assets and requirements that we needed to meet each iterative sprint throughout the quarter.\n\n Within the collaborative team environment, my goals were to gain experience and learn the process of game development, particularly in the context of the Unity game engine. I wanted to enhance my programming skills by working on an extensive project, while also acquiring knowledge in the different aspects of game development that don't pertain to just programming.\n\n The challenges involved working and communicating effectively in a small team to develop a polished product while also simultaneously making sure we were on track to meet established weekly deadlines. Despite our limited experience with Unity, we were able to develop a fully functional beta version of our game with different components and features such as an adaptive UI, lighting, and animation.\n\n I learned a lot within my role as co-game developer and gained valuable insights into the collaborative process of game development. Through collaboration with the IMD group, I enhanced my programming skills and gained a broader understanding of the various aspects of game development, including asset management, feedback iteration, and game design considerations. "
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-4-215",
            "title": "Tulalip Resort Casino Capstone Project",
            "studentName": "Austin Losik",
            "studentMajor": "CSSE",
            "projectType": "Current Employer",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "./posters/csse/losik_austin.jpg",
            "abstract": "For my capstone project, I was able to utilize my current job at The Tulalip Resort Casino as a database analyst. However, for the sake of my capstone period, my directors allowed me to develop my own project in which I would be creating a custom database application used within the finance department. I have been working with Tulalip as a database analyst since 2021, however, the duration of this project specifically was from January 1, 2023, until June 9, 2023.\n\n As the sole developer of this project, I worked on the project with a full-stack mindset, developing the front and back ends. I was also the person to schedule meetings, acquire user requirements, get feedback, and test the software as it was being developed. For coding I used Microsoft Visual Studio Code and programmed in JavaScript, HTML, and CSS. I used several different frameworks, including Node.js to support the application and EJS for templates. For the database, I used Microsoft SQL Server and Microsoft SQL Server Management Studio.\n\n Throughout the course of this project, I learned about the process of developing my first application from many different viewpoints. I was able to experience the process of developing a backend and troubleshooting to determine how to handle and send data. The process of developing user-friendly front ends that were new but familiar to the end users. But most importantly, working with Professor Kochanski, I was able to learn how to be a better Software Engineer by truly understanding what end users need at a core level. The process of understanding why and where the data goes was ultimately the hardest test throughout my experience during this project. "
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-4-230",
            "title": "Canvas Teaching Tools",
            "studentName": "Tejas Kalyan",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "./posters/csse/kalyan_tejas.jpg",
            "abstract": "In this project, I worked on an application, named Teaching Tools, that provides features to make life easier for users of Canvas. Using React JS with Material UI, I developed the user interface, which interacts with the Canvas backend to offer additional features. The goal of this project was to get experience with web-development, software engineering, and working with a team. My role in this project was implementing several features that were requested by professors and students.\n\n An example of a tool that I worked on is the quiz accommodation tool which allows a grader to provide a time extension or extra attempts to every quiz that a particular student takes. I also implemented a tool that allows instructors to create multiple groups at once, a rubric search tool, and a tool to export syllabi as databases.\n\n The biggest challenges were figuring out how the code worked and learning how to use React and Flask. I faced several errors along the way due to interacting with the code the wrong way. However, I enjoyed the process of solving these problems and learning new skills.\n\n This project gave me experience with full stack development which I had never done before. I became familiar with React JS, making APIs, and working with databases which are all very important technical skills for working in the industry. I also got experience working with a team and joining an ongoing project which made me more prepared for a technical job in the future. "
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-4-245",
            "title": "Learn Databases: A Database Query Learning Tool",
            "studentName": "Reiner Opitz",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "./posters/csse/opitz_reiner.png",
            "abstract": "My capstone project was aimed at improving the translation of relational algebra into standard queries for databases. The Learn Databases project required reviewing and enhancing the existing backend while supporting any continuing front-end development.\n\n The initial state of the project included a working front end website and a back end with limited functionality to support the website. My responsibility was to comprehensively understand the project’s current codebase with the goal of creating a stable and functional backend to facilitate both current front-end requirements as well as future development.\n\n The capstone drew on the knowledge gained from the CSSE program as I leveraged both technical skills and higher-level software engineering concepts to address the existing issues while adapting to emerging problems. The codebase was thoroughly reviewed, considering the architecture my advisor wanted to maintain. By applying some of the principles of pragmatic programming and adopting a growth mindset, I aimed to establish a more sustainable and manageable code base for future contributors.\n\n The integration of both technical and philosophical lessons learned, combined with my evolving though process as an engineer, enabled me to successfully review the existing code base and align it with intended architecture. Employing test-driven development methods, I was able to refactor complex and inefficient code related to the abstract syntax tree and introduced new and practical solutions to the back-end’s relational algebra translator. These efforts resulted in more accessible and extensible back-end functionality.\n\n This capstone project represents the culmination of my educational journey through the CSSE program, providing me with invaluable insights into the complex nature of collaborative project development. Through this experience, I have embraced both the challenges of adopting a comprehensive approach that addressed both the micro-level issues within the code as well as the macro-level considerations of project sustainability. The resulting work I have done aims to deliver reliable, maintainable, and manageable solutions for future contributors.\n\n In conclusion this capstone has not only grown my knowledge about relational algebra, databases, and queries but has proven the transformative nature of the CSSE program in shaping me into an emerging software engineer. "
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-4-300",
            "title": "PHYT - Your Personalized Companion for Physical Health Tracking",
            "studentName": "Pablo Rodriguez",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "./posters/csse/rodriguez_pablo_ramses.png",
            "abstract": "In my capstone project, I developed PHYT, a mobile health app designed to combine important health aspects. These include tracking of food intake, sleep, hydration, weight, and exercise into a singular user-friendly platform. The purpose of this project was to address common issues in the health app industry such as lack of beginner-friendly interfaces, data privacy concerns, feature limitations behind paywalls, needing to have multiple apps installed to track various health aspects. Through the development of this app, it allowed me to learn Swift and SwiftUI from scratch, practice my planning abilities, demonstrate iterative design skills, and hone in on my code-testing skills. The use of these skills resulted in PHYT, a comprehensive, intuitive, and customizable health-tracking app that will be freely accessible to all users. The significance of this project lies in its potential to revolutionize personal health tracking. It provides a solution to the problem of juggling multiple health apps by integrating key features into one platform. In contrast to competitors, PHYT provides all users with full access to its features, promoting health inclusivity and autonomy in health management. The app's unique selling proposition, offering an accessible all-in-one health tracking experience free of paywalls, could disrupt the current health app market, ultimately promoting a more proactive approach to health care and health management. "
        },
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-4-315",
            "title": "CSS 497: SDE Internship with Johns Hopkins University Applied Physics Lab",
            "studentName": "Nam Yoo",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Yang Peng",
            "posterLink": "./posters/csse/yoo_nam.png",
            "abstract": "As a major non-profit research organization, Johns Hopkins University Applied Physics Laboratory is tackling new challenges each day to protect the country and our planet. During the internship, I had a chance to be part of the Internal Research and Development (IRAD) team of the Space Exploration Sector. During my internship at JHU APL, my team focused on the Modeling a Constellation project. This project is a proof-of-concept that demonstrates the capabilities and importance of modeling constellations of satellites in space for national security. The goal of my team’s IRAD project is to provide optimal detections and feedback defined by the user to provide the best coverage of targets on Earth.\n\n In the first two weeks, I had to set up and learn the tools and languages my team used. The main challenge was installing the tools correctly, learning section-specific terms, and learning new tools and languages to get to up to speed. I also practiced how to formulate a question such that my team and my manager understands where I am confused.\n\n During my internship, I worked directly with a simulation framework called Advanced Framework for Simulation and Modeling, also known as AFSIM. The work consists a piece in all aspects of the simulation framework which includes configuration, scenario generation, data processing, and data logging of AFSIM. I also spent time writing scripts that tied different simulation frameworks, ensuring that information could be passed from one tool to the another. AFSIM was difficult to learn due to poor documentation, and no resources are available on the Internet. This is because AFSIM is export-controlled software and release of its codebase to the public is illegal.\n\n To tackle this challenge, I spent many days reading pages of documentation and reaching out to people for help. During the process, I tried to understand the development pattern of AFSIM and read a bunch of its built-in libraries and classes. This provided me with details on how to write and structure the code. For questions that require industry knowledge, I reached out to the APL’s internal AFSIM developer communities.\n\n Overall, my experience at JHU APL was amazing. My team welcomed me and ensured I got all the resources I needed to help me contribute to my fullest. I learned how to read and write documentation, learn new tools, and ask questions without having to answer clarifying questions."
        }              
    ]
}