{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-6-100",
            "title": "Gekko Corporation: Health Monitoring Application",
            "studentName": "Shreya Karnati",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Laurie Anderson",
            "posterLink": "./posters/csse/karnati_shreya.jpg",
            "abstract": "In the United States, most adults only visit their doctor 2-4 times a year. During these visits, vital signs such as heart rate, blood pressure, and body temperature are measured. However, this data doesn’t provide a comprehensive understanding of the individual’s overall health. Additionally, in the wake of the coronavirus pandemic, which has resulted in the rise of virtual appointments, it is harder to get accurate measurements of vital signs for healthcare providers.\n\n To provide a solution for these challenges, Gekko Corporation is developing a cross-platform mobile application that uses data from wearable technology to gather and consolidate health information which is compatible with both Android and IOS platforms. This application aims to collect data from a variety of devices such as Apple watches, Fitbits, Dexoms, Oura rings, and more. Having access to data from these devices provides healthcare workers with a more holistic view of a patient’s health, going beyond the basic vitals obtained during regular check-ups.\n\n With the use of Bluetooth connections, the app collects health data from the connected devices. The HealthKit API in React Native can extract health data such as heart rate, heart rate variability, oxygen saturation, respiratory rate, body temperature, and sleep analysis. This health data is then automatically pulled from the user’s device and sent to a database in Splunk Enterprise. From there, machine learning algorithms are used to analyze the data and create visualizations such as graphs and charts. These visualizations give healthcare professionals a better understanding of a patient’s health trends."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-6-115",
            "title": "Health Visualization and Monitoring Application at Gekko Corporation",
            "studentName": "Davis Zhong",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Yang Peng",
            "posterLink": "./posters/csse/zhong_davis.jpg",
            "abstract": "In an era where healthcare is rapidly evolving, medical appointments serve as pivotal moments for healthcare professionals to assess patients' well-being by recording vital signs like heart rate and blood pressure. However, these 10–30-minute health assessments only allow them a snapshot of an individual's overall health. Moreover, the advent of virtual appointments, propelled by the COVID-19 pandemic, has presented healthcare providers with new obstacles in accurately capturing patient vitals. To address these challenges and ensure comprehensive care, innovative approaches are needed to revolutionize the way we monitor and evaluate patient health.\n\n In response to these challenges, we at Gekko Corporation developed a cross-platform application that leverages individual owned smart devices to collect and analyze patient data. Our application integrates with popular devices such as the Apple Watch, Fitbit, Oura Ring, and Libre Glucose Monitor to allow medical professionals to gain deeper insights into their patients' health conditions and enable a more comprehensive understanding of their overall well-being.\n\n Gekko's Health Application is a mobile application compatible with both Android and iOS platforms, specifically designed to assist healthcare providers in monitoring the health and well-being of their patients through the utilization of commonly used wearable devices. The application offers a user- friendly account creation and setup process, allowing users to effortlessly transmit health data from their preferred devices. Leveraging the HealthKit and Google Fit APIs, the application extracts a wide range of health data, including heart rate, oxygen saturation, respiratory rate, body temperature, sleep analysis, and more from connected devices.\n\n The application is automated to retrieve daily health data from user devices and securely transmit it to the Splunk database instance. Once stored, advanced machine learning algorithms analyze the information, identifying any potential anomalies and transforming the raw data into informative graphs and charts. These insightful visualizations allow healthcare providers to better monitor their patients' health trends, promptly recognize potential risks, and provide personalized recommendations aimed at improving their patients' overall well-being.\n\n Presently, the application is still undergoing a closed beta testing phase, prioritizing the integration of new smart device types, and the onboarding of additional beta testers. Moving forward, we aim to intensify efforts towards improving our web-based application, providing users and medical professionals with an enhanced interface that facilitates their interaction with the data and simplifying the user process for data visualization and analysis.\n\n Overall, our platform enables medical professionals and individuals to efficiently monitor and manage their health using commonly available smart devices, transforming the delivery of healthcare, and improving the overall well-being of users. "
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-6-130",
            "title": "Trickfire Robotics",
            "studentName": "Michael Mendoza",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Clark Olson",
            "posterLink": "./posters/csse/mendoza_michael_p.png",
            "abstract": "TrickFire Robotics is a student-led club focusing to compete in the University Rover Challenge. This is a yearly international competition that is hosted in Utah with over 100 competing teams from all over the world. As a team, we must build a Mars exploration rover capable of aiding astronauts on missions by utilizing the 6-axis robot manipulation arm designed and manufactured by the team.\n\n This arm must be capable of carrying various objects up to 5 kilograms across 1 kilometer of rough terrain and needs to be able to perform dexterous actions such as picking up a small USB, opening drawers, and operating a joystick. This project focuses on developing the embedded software needed to get the arm to be controlled through the Linux middleware suite, Robot Operating System (ROS2), by developing C++ and Python packages and implementing inverse kinematics to achieve precise movement.\n\n During this quarter, I developed software to work with various hardware devices such as a NVIDIA Jetson Orin AGX Developer Kit, motor drivers, BLDC motors, and transceivers. I also used test equipment such as oscilloscopes to verify serial communication messages, specifically CAN FD messages, that are sent between hardware devices. The inverse kinematics of the arm is handled by representing the basic dimensions of the arm with a .urdf file that makes it easier to calculate the angles the joints.\n\n In the end, the 6-axis arm is capable of being controlled by a user and while the inverse kinematics implementation did not get enough time to test with the physical arm there is a solid foundation for the future generation of TrickFire to work on top of. The implementation of this project gives TrickFire Robotics a steppingstone towards being a competitive team in the University Rover Challenge. "
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-6-145",
            "title": "Modeling Regulatory Networks",
            "studentName": "Harper Hults",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Michael Stiber",
            "posterLink": "./posters/csse/hults_harper.png",
            "abstract": "Biological regulatory networks are of interest in multiple fields of science and medicine. Recent work by Evan Patterson et al. used concepts from category theory and database theory to model how chemical reaction networks give rise to biological regulatory network dynamics. Category theory is a field of mathematics which studies compositionality, which is well suited for modelling because scientific models are frequently modular. I built on another software developer’s work to implement this model in the Julia programming language using the Catlab library. Catlab provides an API for doing computations on data structures defined using the language of category theory. After learning extensive mathematical theory, I implemented a data migration function which captures how chemical reaction networks aggregate into biological regulatory networks. The significance of this work is due to how this function is defined: writing the code for the model in Catlab is just writing out the mathematical model. This type of simulation does not suffer from the separation between theory and implementation that traditional scientific modelling does. Building a robust library of models implemented in this way is therefore important to foster widespread adoption of this methodology. Getting more scientists to speak the language of category theory enriches science as a whole by making it more reproducible, widely accessible, and composable. "
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-6-200",
            "title": "Virtual Academic Advisor Security Review",
            "studentName": "Renee Nelson",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Erika Parsons",
            "posterLink": "./posters/csse/nelson_renee.png",
            "abstract": "The Virtual Academic Advisor is a .NET Core Web Application which uses MVC (Model-View-Controller) components to handle UI views, business logic controllers, and models to interface with the SQL database. Currently, the VAA is in the middle of development. External libraries, the SQL database, and most models have been developed. However, many view and controller components are yet to be developed. If not developed securely, views and controllers may create an entry vector for malicious actors. In order to ensure security for future development, a security assessment is performed. The framework for the assessment was taken from the OWASP top 10 Web App Vulnerabilities, with many details taken from their .NET cheat sheet. The methodology used was interviews with past developers and manual code review. The manual code review was performed with a checklist derived from the OWASP Top 10 Web App Vulnerabilities .NET Cheat Sheet. With the findings from the assessment, a security report was drawn up. The report covers which areas are vulnerable, which vulnerabilities the areas are vulnerable too, and new features to (consider) adding or incorporating into the VAA in next steps of development. Areas that are developed but vulnerable have a remediation plan to secure those areas. Areas that are partially developed are given secure coding guidelines to follow. Finally, any areas on the checklist that did not already exist in the system are provided guidelines to add a new security feature."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-6-215",
            "title": "Redrive Tool",
            "studentName": "Catherine Tran",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/tran_catherine.jpg",
            "abstract": "My capstone internship project was focused around creating a front-end tool to redrive missing elements for products being sold by a retail company. The front-end tool aims to simplify the redrive process by allowing users to input or drop a file with contents to be re-driven. Previously, users needed to create a bash script, use SQL, and download certificates to redrive which was not user friendly.\n\n For the project I utilized many technologies. On the backend I used Java for coding and GitLab for version control. On the front end I used React, Next.js, and JavaScript to build my website. To develop my code and make it available to developers through a website I used GitLab CI/CD pipelines, Docker, Amazon S3, and Amazon CloudFront.\n\n My project included creating new endpoints to be used in the website, creating a mock design for the website to receive feedback from the team, and implementing the design to create a website-tool that accepts manual inputs and file uploads of product ID numbers that need to be re-driven.\n\n With all these different technologies came a lot of challenges. I ran into many blockers throughout my journey and needed to collaborate with different engineers and teams within the company to successfully complete my project. "
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-6-230",
            "title": "Exploring Peer Instruction",
            "studentName": "Meng Zhang",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/zhang_meng.jpg",
            "abstract": "This capstone project presented an opportunity to delve into advanced problem-solving using LeetCode. LeetCode is a platform known for its challenging computer science problems and widespread recognition among technology companies. During this capstone project, I solved ten easy-level LeetCode questions and one medium-level question per week and presented them during the weekly meeting. By week seven, I presented to CSS 342 peers to share my problem- solving strategies and gain feedback from my peers. I also created a website to share one hard- level question, and how I solved it. The project carried a multipurpose: to augment personal problem-solving skills, learn from what we taught, and promote an environment conducive to peer learning by sharing problem-solving strategies.\n\n The project began in stages, first with individual practice on LeetCode. Solving ten easy-level questions and one medium-level question provided a solid foundation for future tasks. These initial exercises helped us familiarize ourselves with the problem-solving process and shared insights and strategies with peers through presentations. We received constructive feedback that helped enhance our teaching strategies.\n\n The next phase involved translating this knowledge exchange into a broader platform. A website was designed to present our detailed problem-solving processes and strategies for a hard-level LeetCode question. This was to facilitate more accessible and shared learning experiences among others.\n\n The results of this project were twofold. On a personal level, I improved my problem-solving abilities, gained a better understanding of algorithms, and developed the ability to guide peers through complex questions. Meanwhile, on a collective level, my peers benefited from exposure to problem-solving strategies.\n\n The significance of this capstone project is the peer instruction in the computer science field. It underscores the fact that it helps us get a deeper understanding of the knowledge when we are trying to teach others. It is shared and reciprocated. "
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-6-245",
            "title": "Exploring Peer Instruction",
            "studentName": "Mohamed Gas",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/gas_mohamed.jpg",
            "abstract": "This project aims to enhance coding skills and prepare for technical interviews by utilizing Leetcode coding practice. As part of the CSS 497 Capstone class, I have undertaken the challenge of solving 11 Leetcode problems each week. Additionally, I have been meeting with my faculty advisor on a weekly basis to present a coding question and receive valuable feedback.\n\n The primary objective of this project is to develop proficiency in solving algorithmic problems and improve problem- solving abilities. Leetcode provides a diverse range of coding challenges, covering various data structures and algorithms commonly encountered in technical interviews. By consistently engaging in Leetcode practice, I have been able to sharpen my coding skills and deepen my understanding of fundamental programming concepts.\n\n Furthermore, engagement with my faculty adviser and mentor is an important element of this endeavor. I share a coding topic that I have solved and describe my method and reasons behind the answer during our weekly meetings. This process provides useful insights and suggestions for improving my problem-solving strategies and coding techniques. My mentor's criticism has been really helpful in refining my coding approach and optimizing my solutions.\n\n besides that, I was given the opportunity to give a presentation on a coding topic during one of my faculty member's seminars. I developed slides to illustrate the topic, examined several techniques, and gave an optimized solution for this presentation. This experience has not only enhanced my technical presenting skills, but it has also given me the opportunity to share my expertise with my peers.\n\n Thus, this project has been a worthwhile exercise in terms of preparing for technical interviews and honing my coding skills. A thorough learning experience was offered by the mix of regular Leetcode practice, mentor feedback, and classroom presentations. As a result, I've gotten a better understanding of algorithms and data structures, increased my problem-solving abilities, and gained confidence in confronting coding obstacles."
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-6-300",
            "title": "Exploring Peer Instruction",
            "studentName": "Rashid Ibrahim",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/ibrahim_rashid.jpeg",
            "abstract": "As part of my CSS 497 capstone project, I have undertaken a comprehensive exploration of various data structures and algorithms, including arrays, linked lists, binary search, trees, and priority queues. This abstract provides a summary of my project, highlighting the key topics covered, the outcomes achieved, and the future goals.\n\n Under the guidance of Advisor Yusuf Pisan, I have engaged in weekly problem-solving sessions, honing my problem-solving skills and gaining a deep understanding of these fundamental concepts.\n\n The capstone project has also facilitated collaborative learning through weekly group meetings, where I have presented and discussed medium-level problems. These sessions have been invaluable for exchanging ideas, refining problem-solving techniques, and receiving constructive feedback from my peers.\n\n As a significant milestone of the capstone project, I had the opportunity to give a 15-minute presentation to a CSS 343 class, showcasing my understanding of the covered topics and demonstrating the application of data structures and algorithms. A feedback is gathered on my teaching and presentation skills.\n\n Additionally, I tackled a hard-level LeetCode question as part of my capstone project. This challenge will further deepen my problem-solving skills and provide an opportunity to explore more complex algorithms. I createD a GitHub page to showcase my solutions and provide explanations for the hard LeetCode problem that I solved.\n\n In conclusion, my capstone project has been a transformative learning experience, allowing me to delve into the intricacies of data structures and algorithms. Through problem-solving, research, collaboration, and presentations, I have expanded my knowledge and applied these concepts to solve programming challenges. This abstract provides an overview of the project, emphasizing the topics covered, the methodologies employed, and the upcoming goals of tackling a hard-level LeetCode question and creating a GitHub page. By the end of this capstone journey, I aim to have a comprehensive understanding of data structures and algorithms. "
        },
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-6-315",
            "title": "Enhancing Problem-Solving Skilss for CSS Students: A Path to Technical Interview",
            "studentName": "Phuong Vu",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/vu_phuong.png",
            "abstract": "It is crucial for institutions to provide students with the tools necessary to succeed in technical interviews in a time when computer science graduates face heightened competition for lucrative employment in the software sector as a result of hiring freezes and widespread layoffs. This project aims to address the widespread issue of University of Washington Bothell (UWB) Computing and Software Systems (CSS) students feeling unprepared for job interviews despite the program's excellent foundation in core classes and optional courses.\n\n My Capstone project was created to research and offer systematic advice in addressing programming issues since it was realized how crucial problem-solving skills were in technical interviews. The course used well-known platforms like LeetCode to demonstrate numerous solutions to common interview questions in order to educate CSS students on diverse problem- solving strategies. In addition, a series of seminars were held to evaluate students' problem- solving skills and highlight typical problems.\n\n In order to further clarify my statement, I conducted a small survey on 10 CSS students to assess their readiness in technical interviews, as well as the effect of Leetcode “workshop session” during Professor Pisan’s lecture upon their problem-solving interests and skills. The result showed that many CSS undergraduates lacked the abilities necessary to approach and handle coding issues successfully. However, students showed a considerable increase in their problem- solving skills after attending these Leetcode sessions, which were beneficial for improving academic performance and gaining insight into technical interviews.\n\n The survey proposes two potential approaches for incorporating problem-solving lessons into the CSS curriculum based on its findings. The first strategy is to incorporate Leetcode problems which are related to the class’s current concept into already-existing core subjects like CSS 342 and CSS 343. This has been proven through Professor Pisan’s lectures, which enable students to hone these abilities in addition to their academic studies. The second alternative is to develop a special CSS skills course that is devoted to problem-solving principles, giving students in-depth instruction in this crucial subject.\n\n The CSS program at UWB may better prepare its students for technical interviews by incorporating these problem-solving activities, bridging the gap between academic understanding and industry expectations. Giving students the ability to solve problems improves not just their professional chances but also the CSS division's standing as a source of graduates who are prepared for the workforce. The need for a well-rounded education that covers both the theoretical ideas and the practical abilities needed in the developing software industry is highlighted by this study. "
        },
        {
            "time": "3:30 PM - 3:45 PM",
            "projectId": "csse-6-330",
            "title": "VR Rehabilitation Therapy ProjectS",
            "studentName": "QiQi Hu",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Erika Parsons",
            "posterLink": "./posters/csse/hu_qiqi.png",
            "abstract": "Patients with severe upper extremity weakness, resulting from conditions such as peripheral nerve injuries, stroke, and spinal cord injuries, often struggle to adhere to prescribed therapy regimens due to factors like monotony, lack of motivation, and difficulty tracking progress. This poor adherence can hinder rehabilitation and lead to suboptimal outcomes. To address this challenge, the project aimed to develop an engaging solution that visually confirms muscle activity for upper arm use in a rehabilitation setting.\n\n The goal was achieved through the development of a Flappy Bird virtual reality (VR) game that integrates a custom surface electromyography (EMG) device for upper arm use. The upper arm area was chosen as it is crucial for evaluating muscle activation and movement in patients with severe upper extremity weakness. Myo armband is designed for the forearm, so signal interference in the upper arm disrupts the Myo Armband's muscle activation detection resulting in the armband working 2 out of 10 times. In order to solve the limitation problem, I decided to deploy the armband on the forearm, and it worked 10 out of 10 times.\n\n The project successfully resulted in a playable Flappy Bird VR game controlled by the Myo Armband, a wearable EMG device worn on the forearm. The integration of C#, Unity3D, Blender, SteamVR, and the Myo Armband allowed me to create an interactive and immersive rehabilitation experience.\n\n The potential impact of my solution lies in its ability to offer patients with upper extremity weakness a more engaging therapy experience. By gamifying the rehabilitation process, patients are motivated to participate and adhere to therapy regimens, ultimately improving their outcomes. The successful integration of wearable EMG devices and interactive gaming highlights the potential of this approach in the field of rehabilitation.\n\n Through this project, I gained in-depth knowledge and practical experience in game development, virtual reality implementation, and wearable device integration. The skills acquired, such as problem-solving, interdisciplinary collaboration, and understanding of rehabilitation applications in gaming, will contribute to future advancements in the field."
        }              
    ]
}