{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-3-100",
            "title": "Software Engineering Internship at Restmesh Technologies",
            "studentName": "Ka Hou Chan",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Min Chen",
            "posterLink": "./posters/csse/chan_ka_hou.png",
            "abstract": "During my software engineering internship at Restmesh Technologies, I had the opportunity to contribute to various projects and tasks related to their Restaurant Point of Sale System. One notable project involved redesigning and developing the restaurant waitlist system to improve its usability and user experience.\n\n Recognizing the low utilization rate of the existing waitlist system due to its unfriendly user interface, I was assigned to work with a team of engineers and collaborated with a UI designer to revamp the system. Our efforts included organizing customers into different party groups based on their size, implementing QR codes for customers to check their waitlist status on their phones, and integrating an automated text messaging system to notify customers when their tables were ready.\n\n Additionally, I implemented a Switch Location Button feature for food truck owners to efficiently switch between locations within the restaurant admin page. I also addressed multiple bugs in the system, including fixing the corrupted CSV export format that prevented users from editing the file in Excel. By converting the export format from JSON to CSV properly, users can now download the file from the cloud, edit it in Excel, and upload it back to the cloud seamlessly.\n\n Through these tasks, I gained practical experience in developing real-world features and collaborating with industry professionals. Working as part of a dynamic team at a reputable company exposed me to diverse perspectives and approaches to problem-solving."
        },    
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-3-115",
            "title": "ClipBoard: a keyboard app",
            "studentName": "Dani Shaykho",
            "studentMajor": "CSSE",
            "projectType": "Individual Project: Student Defined",
            "facultyAdvisor": "Dr. Wooyoung Kim",
            "posterLink": "./posters/csse/shaykho_dani.png",
            "abstract": "Clipboard is a cutting-edge iOS keyboard application designed to elevate your text management experience. As a revolutionary upgrade to the native iOS keyboard, Clipboard provides two primary features—accessing copy history from the keyboard, and creating custom lists for easy retrieval of items like emails, website links, or phone numbers.\n\n Developed in response to the limitations of the standard iPhone clipboard and the lackluster design of existing clipboard apps, Clipboard merges an intuitive design with comprehensive features for an optimal user experience.\n\n Clipboard's primary strength is its remarkable time-saving potential. It bypasses the need for multiple app switches when copying different items, allowing for a single swift copy, switch, and paste action. Plus, the list creation feature eliminates repetitive typing, making Clipboard an essential productivity tool."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-3-130",
            "title": "Dermni AI",
            "studentName": "Rahul Pillalamarri",
            "studentMajor": "CSSE",
            "projectType": "Group Project: Student Defined",
            "facultyAdvisor": "Dr. Wooyoung Kim",
            "posterLink": "./posters/csse/pillalamarri_rahul.jpg",
            "abstract": "The most challenging aspect of starting a skincare journey is identifying how to deal your skin type and its underlying issues with respect to different types of acne. This aspect requires a heavy amount of research on the individual’s part which often turns people off from starting to take care of their skin at an early age, as ideally people should start at the age of 13 or 14. Another challenging aspect of starting a skincare journey is that not everyone can afford to go to dermatologists to get help on dealing with their skin lesions and more often than not dermatologists take more than one session to accurately identify what the skin lesion is and how to treat it. Due to these reasons, I decided to create an iOS application called Dermi AI, a mobile app that identifies different skin lesions and informs users on how to treat them. The purpose of this application was to provide people with the ability to self-diagnose their skin lesions according to their skin type and to make the start of their skincare journey easier.\n\n The development of this application is in 2 parts: the mobile app development part and the deep learning part. For the deep learning part of this project, I created my own dataset by web scraping across various dermatology databases in an effort to include a variety of skin complexions in this dataset. The reason being that most dermatology datasets are biased to include only light skin complexions as detecting these skin lesions on darker complexions is much more difficult than to detect them on lighter ones. So in an effort to reduce this bias, I created my own dataset and used this dataset to fine tune a Vision Transformer model developed by hugging face that was pre-trained on ImageNet data. I also applied two preprocessing techniques: Contrast-Limited-Adaptive-Histogram-Equalization (CLAHE) and Anisotropic diffusion. After training, I was able to get a model with 70% accuracy which I then integrated with my mobile application by deploying the model onto the hugging face hub and calling the model in the application. The mobile app was developed using react native and tailwind CSS with AWS as the backend. The AWS services I used was AWS RDS to hold the user profile information, AWS S3 to host the dataset for model training, AWS lambda coupled with API Gateway to read and write to the database and supplemented this with Auth0 to set up the mobile app user authentication.\n\n By the end of my development for this project, I understood how to develop a full stack application from scratch as well as how to create a dataset without any bias, train a model on said dataset, and integrate the dataset with the previously mentioned full-stack application. "
        },    
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-3-145",
            "title": "Protein Binding Site Prediction and Ligand Generation from Cryo-EM Map ",
            "studentName": "Chunyang Lu",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Dong Si",
            "posterLink": "./posters/csse/lu_chunyang.png",
            "abstract": "Locating protein-ligand binding sites is one of the most challenging tasks in drug design. However, recent advances in machine learning have successfully enabled the identification of regions in a protein where a ligand can bind directly. This has led to a strong industry demand for computational structural biology methods that can predict or modify molecular interactions in living systems. To achieve this, near-atomic resolution images of protein-ligand complexes must be analyzed and understood, which is useful for drug discovery or design. In this paper, we aim to utilize advanced deep learning methodologies such as deep convolutional neural networks and graph convolutional neural networks to predict protein and ligand interactions. We have conducted a review of state-of-the-art deep learning methods for predicting protein-ligand binding sites (LBSP) and conducted a comparative study. To study automatic ligand binding site prediction with Cryo-EM maps, we created a relatively large dataset of proteins with Cryo-EM maps and their binding ligand information. By integrating DeepTracer, a fast de novo cryo-EM protein structure modeling method, with LBSP, we establish a potentially practical end-to-end system to locate ligand binding sites directly from Cryo-EM maps. Additionally, we leverage a state-of-the-art molecule design method to generate drug-like ligand from our predicted ligand binding pockets. Moreover, we present a potentially practical end-to-end artificial intelligence system pipeline to generate drug-like ligand directly from Cryo-EM maps. Overall, our findings suggest that deep learning approaches can effectively predict protein-ligand interactions and provide valuable insights for drug design from Cryo-EM maps."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-3-200",
            "title": "Full Stack Development of Eccomerce Store At Emaxocde",
            "studentName": "Bodgan Oros",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Robert Dimpsey",
            "posterLink": "./posters/csse/oros_bogdan.jpg",
            "abstract": "The primary objective of the project was to design and build a user-friendly and visually appealing e-commerce store for a specialty food retailer business that would showcase their unique specialty foods and provide a seamless shopping experience for customers. The motivation behind this initiative was to capitalize on the growing trend of online shopping and enable the retailer to reach a broader audience beyond their physical store location.\n\n To achieve this, a combination of web development technologies and best practices were employed. The project involved extensive front-end and back-end development using modern frameworks and tools, ensuring a responsive and secure website. A comprehensive product catalog, intuitive navigation, and integrated payment and checkout systems were implemented to provide a smooth user experience.\n\n Throughout the project, careful consideration was given to factors such as scalability, performance, and search engine optimization. By implementing efficient coding practices and utilizing cloud-based technologies, the e-commerce store was optimized for high performance and seamless scalability to accommodate future growth.\n\n The results of the project were highly successful. The newly developed e-commerce store provided the specialty food retailer with a robust online platform to showcase their collections and sell their products. Customers gained access to an extensive product catalog, detailed product information, and a streamlined checkout process, resulting in increased sales and customer satisfaction.\n\n The significance of this project lies in its ability to enable the specialty food retailer to compete effectively in the digital marketplace. By establishing a strong online presence and providing a seamless shopping experience, the retailer can attract new customers, expand their market reach, and enhance their overall business performance.\n\n In conclusion, this capstone project successfully addressed the challenge of developing a comprehensive e-commerce store for the specialty food retailer. Through meticulous web development, the project achieved its objectives of enhancing the retailer's online presence, expanding their customer base, and facilitating increased sales. The project's success highlights the importance of embracing digital solutions in the retail industry to remain competitive and meet the evolving needs of customers in the online marketplace."
        },    
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-3-215",
            "title": "Analytics 4 Everyone Internship",
            "studentName": "Abd-Alrahman Shaath",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Robert Dimpsey",
            "posterLink": "./posters/csse/shaath_abdalrahman.png",
            "abstract": "For this capstone, I had the opportunity to intern at Analytics 4 Everyone (A4E), a company specializing in providing business analytic solutions for their decision-making; this comes in the form of Artificial Intelligence and Data Science. During this internship, I worked on the Diverse Translator Project. The Diverse Translator Project is an application that essentially acts as a translator for scientific/engineering terms. Many dictionary applications exist; however, these applications are too general; our application aims to provide translations for technical words, and the language of focus is Arabic. The project started with an un-clean dictionary database; our job was to clean this database, then make a fully-fledged website and mobile application based on it.\n\n I was given various tasks throughout the project; my first task was to port the Microsoft Access DB to PostgreSQL. The reason for porting the database is due to the inflexibility of the database’s API; the only solution was to switch it to a more flexible and dynamic database. There is no direct way to port one database to another, so I created a data shift process between the old and new databases. My solution was to use a common, easily exportable/importable data format between the two databases: CSV files. I chose CSV files over .txt files because of their increased flexibility. I then ported the CSV files to the new Postgres Database; it is here where an issue occurred. The database was unclean, so I created and ran a Python script to clean the data. After the database was clean, the team and I built the website.\n\n I created the homepage UI and backend APIs. My colleagues worked on user management, authentication, and Docker/Kubernetes. I programmed the main UI of the website using vanilla HTML/CSS/JS. We are currently looking at deploying the application on the cloud and creating a full-fledged testing pipeline. In this project, we used a DevOps philosophy where all aspects of the team communicate and coordinate with each other.\n\n This internship showed me the entire course of creating a website, from finding and cleaning a database; to deploying it on a server. Before this internship, I didn’t know about Docker, DevOps, or deployment; after it, I can confidently say I can understand the general process of creating and deploying a website. The internship mentor also gave me many learning resources to learn and grow my understanding of mobile frameworks, deployment, and testing. "
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-3-230",
            "title": "Miniature Distributed Raspberry Storage System",
            "studentName": "Tony Le",
            "studentMajor": "CSSE",
            "projectType": "Group Project: Student Defined",
            "facultyAdvisor": "Dr. Robert Dimpsey",
            "posterLink": "./posters/csse/le_tony_thanh.png",
            "abstract": "Many technological innovations today require working with large amounts of data. Machine Learning & Artificial Intelligence models require vast amounts of training data for the system to function accurately. Almost all companies use data to understand user behaviors and improve their business models. Even biotech requires vast amounts of data to better understand how to build their systems. With this much data, there needs to be an efficient scalable way to store all of it. Rather than commission some massive storage drive, the common method is to distribute the data across many commercially available drives. This comes with the added complexity of data consistency, drive failures, performance, and many more.\n\n For our capstone project we wanted to learn about the many techniques used to ensure functionality from a distributed storage system. We also wanted to build a miniature model using Raspberry Pi & Raspberry Picos in order to replicate and see some of these functionalities and complexities for ourselves. For many problems, there are multiple solutions that come with various benefits and drawbacks. We wanted to learn about which method is best used to solve each problem depending on the system constraints.\n\n Upon the completion of the project we learned about various techniques used for building a distributed storage system. We learned about things all the way from storing data in multiple regions, all the way down to the individual drives. We were also able to successfully build the system up to where our budget allowed. (Multiple storage nodes & one server) While we weren’t able to fully build out the entire system, we built a strong understanding of how the higher levels worked even though we didn’t implement them. "
        },    
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-3-245",
            "title": "Miniature Distributed Raspberry Storage System",
            "studentName": "Dat Vo",
            "studentMajor": "CSSE",
            "projectType": "Group Project: Student Defined",
            "facultyAdvisor": "Dr. Robert Dimpsey",
            "posterLink": "./posters/csse/vo_dat.png",
            "abstract": "Many technological innovations today require working with large amounts of data. Machine Learning & Artificial Intelligence models require vast amounts of training data for the system to function accurately. Almost all companies use data to understand user behaviors and improve their business models. Even biotech requires vast amounts of data to better understand how to build their systems. With this much data, there needs to be an efficient scalable way to store all of it. Rather than commission some massive storage drive, the common method is to distribute the data across many commercially available drives. This comes with the added complexity of data consistency, drive failures, performance, and many more.\n\n For our capstone project we wanted to learn about the many techniques used to ensure functionality from a distributed storage system. We also wanted to build a miniature model using Raspberry Pi & Raspberry Picos in order to replicate and see some of these functionalities and complexities for ourselves. For many problems, there are multiple solutions that come with various benefits and drawbacks. We wanted to learn about which method is best used to solve each problem depending on the system constraints.\n\n Upon the completion of the project we learned about various techniques used for building a distributed storage system. We learned about things all the way from storing data in multiple regions, all the way down to the individual drives. We were also able to successfully build the system up to where our budget allowed. (Multiple storage nodes & one server) While we weren’t able to fully build out the entire system, we built a strong understanding of how the higher levels worked even though we didn’t implement them. "
        },
        {
            "time": "3:00 PM - 3:30 PM",
            "projectId": "csse-3-300",
            "title": "Road Trip Planner",
            "studentName": "Pavan Korumilli, \n\n Mark Downs, \n\n Justin Guilarte",
            "studentMajor": "CSSE \n\n CSSE \n\n CSSE",
            "projectType": "Group Project: Student Defined",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/downs_mark_thomas.jpg",
            "abstract": "Traditional navigation applications and websites just show how to get a user from point A to point B, Road Trip Planner creates a more immersive experience for user’s. Road Trip Planner currently provides a user-friendly interface that allows users to find the best route and the cheapest gas stations along that route; this way users can plan their trip ahead, knowing the budget that takes to finish the trip. Future iterations of the project will include allowing users to add a hotel they would like to stop at, prices for hotels in the area, and different navigation POV’s.\n\n For the website, We learned to use different technologies like react, html, bootstrap and CSS. We build the front end using React framework. We used CSS alongside Bootstrap and other React libraries such as Chakra UI to design multiple website attributes such as navigation bar and scrolling through the website.\n\n For hosting the website, we used Azure Static Web Apps, a service that allowed us to deploy the website using an agile architecture model. Every time we uploaded code changes to our Github repository, the website was redeployed through Azure. This service combined both the frontend code with back end code in a user friendly manner that allowed us to deploy the website within a week and update it every week.\n\n Finally, the IOS application was created with Swift/SwiftUI and takes all of the same components that the website contains and places them all in a simple phone application. The application uses MKMapKit as an API to retrieve the origin and destination location for the user, creating the coordinates from the address that the user has selected. Finally, once the user enters all of their car information, the route from the user’s origin to their destination is displayed along with gas stations. The user can also view the details of their trip in this view.\n\n Our final result was being able to build applications that simplified trip planning in a user- friendly manner combining best routes to the user destination and gas stop prices to have a better idea of budget planning for the user’s desired trip. "
        }
    ]
}
