{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-5-100",
            "title": "College Affordability Backend Testing Tool",
            "studentName": "Kyle Van Huynh",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/huynh_kyle_van.png",
            "abstract": "The College Affordability Application is an ongoing project that aims to help Washington State policy makers and prospective college students estimate the cost of attendance and financial aid they are eligible for based on their chosen college. The tool draws data from a variety of sources and factors in an individual’s financial situation and potential aid to provide a comprehensive estimate of the total cost of attendance based on these parameters.\n\n The application necessitates comprehensive testing, which currently poses challenges for end- users due to its time-consuming nature. Additionally, developers have noted facing difficulties when conducting backend tests due to their unfamiliarity with the tech stack. This learning curve creates inefficiencies and prolongs tasks that should otherwise be straightforward.\n\n During the course of working on this project, one of the key achievements is the development of a user-friendly website dedicated to executing test scripts using the Django Python web framework and CSS, HTML, and JavaScript. This solution has effectively addressed the issue of time-consuming and cumbersome testing processes for end-users. I created a Django web application which allows users to run tests with a single click and view configuration files and logs with easy navigation.\n\n Before the implementation of the website, developers had to manually enter console commands and log in to the backend to review files, which was not only inefficient but also prone to errors. The implementation of a user-friendly and straightforward interface has garnered positive feedback from end-users, who have expressed their satisfaction with the time and effort saved when utilizing this tool in comparison to the previous workflow for running tests.\n\n The integration of an efficient and streamlined interface for developers working on the College Affordability Application has effectively replaced manual, time-intensive tasks. Users have provided feedback stating that this new interface has significantly reduced their time and effort requirements. "
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-5-115",
            "title": "College Affordability Model - Backend Development",
            "studentName": "Austin Morales",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/morales_austin_ferdinand_ricafrente.jpg",
            "abstract": "The College Affordability Model is a website created to calculate the total cost of attending a university in Washington. The website is used as a tool for users like students to gauge the cost of college and for policymakers to understand how policies affect college affordability.\n\n During my time working with the research group, I primarily worked on the site’s backend by initially being responsible with three tasks. The tasks were checking how recent our data was in our database, creating internal diagnostic tools to trace where in our backend database queries are being executed, and verifying the integrity of current URI string being generated for the website.\n\n For checking the most recent date in our database, I created a script that connected to our production database to iterate each table, extract the most recent year given a time field is present, and list each table associated with their most recent data entry.\n\n To understand the site’s backend interactions with our database, I created a set of diagnostics tools to solve this problem. First tool was middleware that was executed for each HTTP request that analyzed the frequencies of how often a table was referenced and how often a query was being referenced. Second tool was a script that analyzed log files based on a developer configuration to trace accurately what corresponding query was being executed from through a stack trace.\n\n Having a utility to verify how recent our data is beneficial to the research group since the website uses a large set of parameters to determine college affordability. Since the data received from WSAC is on a rolling basis, its crucial to know which data is recent or dated.\n\n The existence of having a set of diagnostics tools to understand how database interactions work with our backend has proven to be greatly desirable. By using these internal tools, existing and future developers working on this project are given the opportunity to have measurable results to further optimize the performance of our site’s backend.\n\n During my time in this research group, it was great utilizing my knowledge from previous classes and applying it for use here. It was interesting fulfilling the needs of my stakeholders and attending bi-weekly meetings to report on accomplishing these tasks. While diving in the codebase and going through the documentation was daunting, the work and team alone was a worthwhile experience. "
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-5-130",
            "title": "Language Learning Assistant",
            "studentName": "Parth Nain",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/nain_parth.png",
            "abstract": "renshuu.org is a platform built as a tool that people can use to learn Japanese. There is a large community associated with the platform and they interact on discord for learning events, classes, and finding friends to study alongside. One of the features of the community discord is a “studypal” text channel for people to share information about themselves. Members of the community can browse this channel and reach out to people who fit them for a study partner.\n\n This channel was very active, with many people writing descriptions and looking to study with others, but very few of the interactions led to long-term study partnerships, and many people who might come in with a high degree of enthusiasm for learning could be disheartened by the lack of responses. Some users also found it difficult or inconvenient to reach out to people privately.\n\n The solution is a learning assistant that is built on top of the discord.js framework, which allows a bot to interact with users to make this process more effective. This begins with a first phase, where users are asked for information to help us match them with others. Matching is based on constraints including age preference, proficiency, availability. This information is saved into a database, and users can move on to a second phase where they are presented with a list of all possible matches and can add other users as “studypals”. The third phase allows users to create their own classrooms in the community server, including text and voice chat, invite their pals and have their own learning events. The fourth and final phase includes a series of learning activities, which anyone in the classroom can participate in.\n\n This solution has been fully implemented and integrated into the learning community, and there has been high interest in using this feature regularly. In the first few hours of release, over 100 people were already making profiles and adding friends. Many of the activities that are included in the learning assistant were suggested by members of the community, and they indicated their excitement to use these activities.\n\n The problem has been solved, and more results will come as the feature is used more. The positive feedback and high level of engagement has been very rewarding, and the skills used to develop this learning assistant are going to be valuable moving forward. "
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-5-145",
            "title": "Identifying Rural Communities Using Satellite Imagery and Deep Learning",
            "studentName": "Inkar Kapen",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/kapen-inkar.jpeg",
            "abstract": "The research project targets remote secluded communities across large regions of the globe. In this project, a U-Net model is trained using the OpenEarthMap satellite imagery dataset to identify land features, such as buildings, roads, trees, water, cropland, bare land, agriculture land, rangeland, and developed areas. The project aimed to develop a model capable of accurately identifying and classifying various land features and objects in satellite images.\n\n The purpose of this work was to enable humanitarian organizations and community health systems to gain knowledge about the communities in the area. This has a high impact and helps NGOs and local policymakers to meet the needs of people in rural areas and plan relief efforts in cases of crisis or natural disasters.\n\n The result of this project, despite significant efforts, the result of the research project revealed that the developed model did not achieve the desired level of accuracy. The model's performance in semantic image segmentation fell short of expectations, exhibiting limitations and inconsistencies in correctly classifying various land features. The primary limitation of this project was the scarcity of labeled rural satellite imagery accessible for training the model.\n\n The project sheds light on the challenges and complexities associated with semantic image segmentation, particularly in the context of remote sensing and satellite imagery. It is important to acknowledge that achieving high accuracy in semantic image segmentation is a complex task, influenced by factors such as data quality, model architecture, training methodology, and feature representation. This research project serves as a valuable learning experience and highlights the need for continuous refinement and optimization in the field of semantic image segmentation using satellite imagery.\n\n Moving forward, addressing the limitations observed in this research can lead to improved models and methodologies for accurate semantic image segmentation. This can have significant implications in various domains, including urban planning, environmental monitoring, disaster management, and resource allocation. Future models can contribute to more informed decision-making processes and sustainable development practices. "
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-5-200",
            "title": "Analyzing the Spread of Misinformation: A Machine Learning Approach",
            "studentName": "Mike Jansen",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/jansen_mike.png",
            "abstract": "The pervasive spread of misinformation on the internet has become a pressing issue, as distinguishing between real and fake news becomes increasingly challenging. In response to this problem, this research project aimed to analyze the nature of misinformation and develop a machine learning model capable of effectively classifying and identifying fake news. By harnessing the power of machine learning, which can uncover subtle patterns unnoticeable by humans, the project sought to identify key indications of fake news.\n\n The project primarily focused on linguistic analysis, employing specialized tools to compute textual features of the text. These features were then utilized to compare datasets and topics, enabling a comprehensive examination of the characteristics of fake news. However, a notable finding emerged from this investigation. It was discovered that generalizing fake news proved to be a difficult task due to significant variations in textual features based on the platform, source, and topic of the text. Consequently, a consistent and reliable approach to predict misinformation was increasingly difficult.\n\n This research project holds significant importance due to the rising impact of misinformation on society. By attempting to develop a machine learning model that could accurately identify fake news, it aimed to contribute to the ongoing efforts in combating the dissemination of false information. While the findings revealed the challenges in achieving a universal prediction mechanism, they shed light on the complex dynamics underlying the spread of fake news across different contexts, sources, and topics. "
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-5-215",
            "title": "A Package for Analyzing Fairness of Mobility Models",
            "studentName": "Daniel Wang",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/wang_daniel.jpg",
            "abstract": "Mobility models, which simulate movement patterns of individuals or groups, play pivotal roles in assisting urban planning, transportation, and public health. As these mobility models are progressively used to create new government policies and allocate resources in cities, it is crucial to consider the impact of amplifying or perpetuating existing biases or unfairness. Currently, the existing research is aimed at generating synthetic traces from real historical data and protecting the privacy of traces, but rarely on the fairness dimension of these mobility traces.\n\n This research specifically investigates the fairness dimension of mobility models. The fairness will be determined by analyzing the Common Part of Commuters (CPC) for different sensitive groups. CPC is the metric that is used in measuring how accurate the synthetic traces are compared to the real data. The different sensitive groups will be created by grouping the extremities of CDC’s Social Vulnerability Index (SVI), which considers a range of factors including socioeconomic status, household composition, race/ethnicity/language, and housing/transportation.\n\n By analyzing the CPCs of the two sensitive groups (wealthy and poor), we can attempt to find if there is any underlying bias in the models. We found in our results that the poorer regions performed better in the models than the wealthier ones. We also found that as models improved their accuracies, the difference in distribution between the two sensitive groups increased.\n\n This research will result in a package extension that will allow all users to analyze for fairness in Mobility Models. By conducting this research, our objective is to raise awareness of the significance of fairness in machine learning models. Additionally, we seek to emphasize the importance of understanding biases in machine learning models. "
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-5-230",
            "title": "Counterfactual Fairness for Mobility Model",
            "studentName": "Zeyuan Xu",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/xu_zeyuan.png",
            "abstract": "For my capstone project, I worked on creating the counterfactual fairness function for the mobility model fairness package. Mobility models simulate the movement flow of individuals or groups which could be useful for resource allocation, network designing, and government policies. Therefore, it is important to consider the fairness of these models and spot the potential biases. The package contains different fairness measurement metrics to help examine the possible bias in these models.\n\n During the implementation, there are several issues I encountered as to what direction I want to take to implement the function. According to the definition of counterfactual fairness, a metric that checks whether a classifier produces the same result for one individual as it does for another individual who is identical to the first, except with respect to one or more sensitive attributes. I decided to let the function randomly select one pair (pair1) from the dataset, find pairs that are similar to the pair1 based on its feature, find another pair (pair2) with the sensitive attribute that is completely different from pair1 and compare pair1’s CPC with pair2’s CPC.\n\n As a result, the function is able to successfully return the score of the comparison and I was able to generate graphs for multiple models based on their scores. This is huge for me considering I have no previous experience with Python or counterfactual fairness metric, to be able to successfully implement the function and produce the correct result really helps me and adds to my experience with machine learning concepts. I truly enjoyed this project! "
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-5-245",
            "title": "Sila Nanotechnologies Software Engineering Internship",
            "studentName": "Veronika Bykova",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/bykova_veronika.jpg",
            "abstract": "My capstone project was an internship at Sila Nanotechnologies Inc. as a Software Engineer Intern on their Systems Engineering & DevOps team. Sila Nanotechnologies is a late-stage battery development startup whose mission is to produce lithium-silicon batteries that will be able to compete with Tesla.\n\n The internship project at Sila focused on migrating a legal team's dashboard application from a Docker- based environment to Kubernetes. The objective was to improve the application's performance, scalability, and availability.\n\n Initial weeks involved onboarding, training in Docker and learning containerization principles, setting up the development environment, and getting familiar with the code base. Docker, a containerization tool, is known to be faster and more light-weight than virtual machines. Docker consists of images (blueprints for containers) and containers (executable instances of images). Images created using Dockerfiles are similar to .h files in C++, while containers are managed through the Docker API or command line interface. Containers provide isolation and act as stateless processes.\n\n To get more hands-on practice with Docker, I worked on a personal project, which was approved by my manager, and then jumped into the actual migration of the Legal app from Docker-compose to Kubernetes. My progress was slightly shattered after I got Covid at work during week 4, but I continued learning Kubernetes and working on the app after recovery. I was able to successfully launch my first “hello-world” Kubernetes application from a template provided by my team. I had to overcome some bugs and obstacles, it was overall a challenging but rewarding process.\n\n After the app was successfully migrated, my progress was mentioned at the monthly Data Systems department standup by my manager. Afterwards I moved onto getting familiar with the Zero Trust technology and got to set up a Cloudflare tunnel with the help of one of my teammates. The purpose of the tunnel was to route traffic to the Sila Legal app in Kubernetes, which provided access to the app for our employees outside the United States.\n\n The last month I spent working on the Software Engineering team enhancing the UI of the migrated app using JavaScript, CSS, and HTML. Overall, the project achieved the successful migration of the legal dashboard application to Kubernetes, improving its performance, scalability, and flexibility for the legal team, as well as the User Interface. "
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-5-300",
            "title": "Software Engineer Internship @ Redx Electrical Technology Ltd",
            "studentName": "Yanqi Qiu",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/qiu_yanqi.png",
            "abstract": "The internship project aimed to develop a face recognition system by implementing multiple CNN architectures and optimizing them for improved performance. Tasks included data preparation, model architecture design, and model optimization techniques. The project addressed the need for accurate identification and measurement of facial features in images, which is crucial for applications such as security, access control, and mobile device unlocking.\n\n The project employed techniques such as normalization, standardization, and dimensionality reduction for data preparation. These methods aimed to map the data to a predefined range, achieve Gaussian distribution, and reduce data complexity. By utilizing CNN architectures, the project tackled the limitations of traditional Multi-Layer Perception (MLP) models in processing image data.\n\n The project's significance lies in its contributions to improving the accuracy and efficiency of face recognition technology. CNNs were shown to preserve spatial information and important features, resulting in more accurate face recognition. The practical applications of face recognition in security, convenience, and efficiency were emphasized.\n\n Additionally, the project employed model optimization techniques to address common challenges like overfitting and underfitting. Techniques such as data augmentation, early stopping, and dropout were used to enhance the model's generalization and performance on unseen data.\n\n In conclusion, the project involved developing a face recognition system using CNNs. It encompassed tasks like data preparation, model architecture design, and model optimization. The project's significance lies in its advancements towards accurate and efficient face recognition, benefiting areas such as security and access control. "
        },
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-5-315",
            "title": "City of Carnation",
            "studentName": "Sidd Rao",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/rao_sidd.png",
            "abstract": "The purpose of this project was to develop an intuitive and user-friendly mobile application that caters to the needs of the City of Carnation residents. The City of Carnation is a small town close to Redmond and Duvall. Despite the small size, the flow of information between the city and its residents has not always been smooth, and consistent. Therefore, the application will offer a range of features including real-time news and updates from the city, a calendar of events, and a convenient platform for citizens to submit work orders, and more. The app will serve as a consistent communication platform, fostering efficient communication between the city and its residents.\n\n By employing the chosen method of developing a mobile application, we leverage the ease and familiarity that many people already have with mobile interfaces. We can also engage in quicker and more efficient communication using mobile features such as notifications and more.\n\n What resulted from this project is a functional mobile application tailored to the specific needs of the City of Carnation. Through the app, users have access to the latest news and updates from the city, including important announcements and community events. The work order submission feature enables citizens to report issues or maintenance requests directly to the city, simplifying the process and allowing for prompt resolution. Additionally, the app provides a user-friendly interface and a seamless experience for exploring and engaging with the city's services.\n\n At the time of writing, the app is still in development, with the recent completion of its initial version. While the first version encompasses key features, it is important to note that there are plans for continuous growth and improvement. In the future, additional features and enhancements will be introduced, expanding the capabilities and usefulness of the app.\n\n In conclusion, this project aims to create a user-friendly and efficient mobile application. By facilitating citizen engagement and providing timely information, the app seeks to enhance the overall experience of residents and promote a more connected and vibrant community. "
        }              
    ]
}