{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-1-100",
            "title": "Power BI Dashboard Analysis",
            "studentName": "Selam Kashay",
            "studentMajor": "CSSE",
            "projectType": "Group Project: Student Defined",
            "facultyAdvisor": "Dr. Nancy Kool",
            "posterLink": "./posters/csse/negash_kirubel.png",
            "abstract": "For this independent capstone project, I worked as part of a 2-person team developing a Power BI dashboard for use by an engine manufacturing company.  The system analyzes critical metrics (engine production, warranty claims, replacement parts, and failure incidents); further, these metrics are visualized on a Power BI dashboard. The goal is to provide the company with actionable insights to improve operational efficiency, identify areas for improvement, and make informed business decisions.\n\nTo achieve the project goals, we employed a comprehensive approach that involved data collection, cleaning, and importing using Visual Studio and SQL. The collected data from various sources, including the replacement parts, build volume, failure, and claims, was analyzed using SQL queries to derive meaningful insights. The data was then transformed into visualizations using Power BI, to create an interactive and informative dashboard.\n\nThe dashboard, which provides a comprehensive overview of engine manufacturing operations, was built on a database management system that allowed the company to store and manage its data securely and efficiently. This ensured that the data was always up-to-date and that the company could easily access the data it needed to make informed decisions. It lets the company track build volumes, identify regions with high failure rates, analyze warranty claims, and monitor replacement part usage. This information can be used to optimize production processes, improve quality control measures, and enhance customer satisfaction.\n\nOverall, the project used industry-standard tools and techniques to ensure accurate data analysis and effective visualization. We leveraged our technical competencies in data management, database querying, and dashboard development by employing Visual Studio, SQL, and Power BI. Using these tools, we collected, cleaned, and analyzed data from various sources. We then used this data to create visualizations that helped the company to track performance, identify trends, and make informed decisions.\n\nMy primary responsibilities in this team project included transforming raw data into meaningful visual representations by designing and developing a visually appealing Power BI dashboard. This involved implementing data cleansing techniques and ensuring data integrity. I also took on the responsibility of This included selecting appropriate chart types, applying data visualization best practices, and creating an interactive user experience.\n\nIn conclusion, we developed a Power BI dashboard that helped the company gain insights into their production, claims, and failure incidents. The dashboard was developed by integrating data analysis, visualization, and database management skills. A final demo showed that this project gives the company a powerful tool for informed decision-making and process optimization."

        },    
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-1-115",
            "title": "Power BI Dashboard Analysis",
            "studentName": "Kirubel Negash",
            "studentMajor": "CSSE",
            "projectType": "Group Project: Student Defined",
            "facultyAdvisor": "Dr. Nancy Kool",
            "posterLink": "./posters/csse/negash_kirubel.png",
            "abstract": "For this independent capstone project, I worked as part of a 2-person team developing a Power BI dashboard for use by an engine manufacturing company.  The system analyzes critical metrics (engine production, warranty claims, replacement parts, and failure incidents); further, these metrics are visualized on a Power BI dashboard. The goal is to provide the company with actionable insights to improve operational efficiency, identify areas for improvement, and make informed business decisions.\n\nTo achieve the project goals, we employed a comprehensive approach that involved data collection, cleaning, and importing using Visual Studio and SQL. The collected data from various sources, including the replacement parts, build volume, failure, and claims, was analyzed using SQL queries to derive meaningful insights. The data was then transformed into visualizations using Power BI, to create an interactive and informative dashboard.\n\nThe dashboard, which provides a comprehensive overview of engine manufacturing operations, was built on a database management system that allowed the company to store and manage its data securely and efficiently. This ensured that the data was always up-to-date and that the company could easily access the data it needed to make informed decisions. It lets the company track build volumes, identify regions with high failure rates, analyze warranty claims, and monitor replacement part usage. This information can be used to optimize production processes, improve quality control measures, and enhance customer satisfaction.\n\nOverall, the project used industry-standard tools and techniques to ensure accurate data analysis and effective visualization. We leveraged our technical competencies in data management, database querying, and dashboard development by employing Visual Studio, SQL, and Power BI. Using these tools, we collected, cleaned, and analyzed data from various sources. We then used this data to create visualizations that helped the company to track performance, identify trends, and make informed decisions.\n\nMy primary responsibilities in this team project included transforming raw data into meaningful visual representations by designing and developing a visually appealing Power BI dashboard. This involved implementing data cleansing techniques and ensuring data integrity. I also took on the responsibility of This included selecting appropriate chart types, applying data visualization best practices, and creating an interactive user experience.\n\nIn conclusion, we developed a Power BI dashboard that helped the company gain insights into their production, claims, and failure incidents. The dashboard was developed by integrating data analysis, visualization, and database management skills. A final demo showed that this project gives the company a powerful tool for informed decision-making and process optimization."
        },
 
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-1-145",
            "title": "Converswim: A Conversation Reflection Tool For Autistic Adults ",
            "studentName": "Aaron Carbonell",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/carbonell_aaron_paulbelleza.jpg",
            "abstract": "Autistic adults commonly face challenges in reading emotion, body language, and other non-verbal social cues when it comes to conversating with neurotypical individuals. As a result, it is difficult for these individuals to have social interactions based on neurotypical social norms with others where both parties are co-creating common meanings of the interaction. To research how autistic individuals internalize and externalize their own emotions during social interaction, Dr. Zolyomi developed what she refers to as a “conversation swimlane activity.” Facilitating the activity involved presenting paired participants with a swimlane template (as pictured below), asking them to think through a recent conversation, and recording appropriate visuals that represented what they felt internally and how they felt they expressed themselves externally.\n\nTo continue Professor Zolyomi’s work, the overall goal of my capstone was to recreate the swimlane activity into a functional web application. The app is designed to be used as an intuitive tool for autistic users to reflect on conversations they have with neurotypical individuals, including visualizing their internal emotions and how they felt they were expressed externally, which will help users learn where common ground and confusion occurred in the experiences of both parties during the conversation.\n\nTo continue Professor Zolyomi’s work, the overall goal of my capstone was to recreate the swimlane activity into a functional web application. The app is designed to be used as an intuitive tool for autistic users to reflect on conversations they have with neurotypical individuals, including visualizing their internal emotions and how they felt they were expressed externally, which will help users learn where common ground and confusion occurred in the experiences of both parties during the conversation.\n\nTo continue Professor Zolyomi’s work, the overall goal of my capstone was to recreate the swimlane activity into a functional web application. The app is designed to be used as an intuitive tool for autistic users to reflect on conversations they have with neurotypical individuals, including visualizing their internal emotions and how they felt they were expressed externally, which will help users learn where common ground and confusion occurred in the experiences of both parties during the conversation.   "
        }  ,
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-1-200",
            "title": "Software Engineer Internship @ GOKiC",
            "studentName": "Juliana Feliciano",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/feliciano_juliana.jpg",
            "abstract": "For my capstone project, I interned as a software engineer at GOKiC which is a non-profit organization that is committed to empowering young kids of color to explore technology. My role is to provide allyship for people looking to support kids of color. The focus of my project is to develop a new feature for GOKiC’s Allyship app which allows users to reflect on their feelings, emotions, and personal journey towards allyship.\n\nUsers of Allyship app have been requesting a new feature that provides a safe space where users can document their progress, challenges, and growth. During my internship, I designed and developed the journal feature using different technologies and tools like Angular, Ionic, GitHub, Karma, and Jasmine. I first worked on developing the frontend of the journal feature focusing on user needs to design the user interface then moving forward to implementing the journal functionalities like creating, editing, and deleting entries. The next step was to develop a local database to save journal entries on users’ devices. Using a local database reduces the number of API calls between the app and services that the app uses. The Allyship app uses a document database and utilizes Ionic’s storage feature to manage user data. I leveraged the existing codebase to implement a container that stores user’s journal entries. As a result of my project, users can now access the journal feature, create entries, and easily review their past reflections.\n\nThe significance of developing the new features is that it provides a space for users to express themselves and track their allyship progress. The internship also goes beyond its technical side, it serves as a valuable learning experience, allowing me to deepen my understanding of app development and enhance my skills in creating user-friendly designs. Throughout this internship, I gained practical knowledge in user interface design, git control, system organization, and also applied my learnings from classes to my project. My key takeaway from this internship is to always ask questions, learn new things, and connect with mentors and peers."
        }   ,
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-1-215",
            "title": "UWB Accessible 3D Interactive Map",
            "studentName": "Brennan Richards",
            "studentMajor": "CSSE",
            "projectType": "Individual Project: Student Defined",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/richards_brennan.jpg",
            "abstract": "In this capstone project, an accessible, interactive map of UW1 was developed to enhance usability and accessibility while providing better access to school services. The project's main drive stemmed from a personal interest in pathfinding algorithms, the opportunity to create a beneficial tool for students, and a desire to understand what makes an application truly accessible.\n\nThe project's comprehensive design involved the creation of a Python web scraper to collect data on various courses and professors, which was then stored in a SQL database. Moreover, a tool was developed to generate walkable areas on each floor of the building, coupled with the implementation of the Manhattan distance A* pathfinding algorithm to determine the shortest paths.\n\nInitial planning presented a significant challenge due to the complexity and multifaceted nature of the project. Learning to work with new tools and tackling technical issues such as Python's lack of synchronous multithreading support also posed hurdles. For instance, asynchronously scraping over 500 course pages, each demanding loading time, presented a unique challenge.\n\nIn response, a custom paint tool was designed to draw walkable areas over a floor plan image and assign room locations. The collected data was then displayed in an interactive 3D environment using React, specifically React Three Fiber, marking my inaugural use of JavaScript.\n\nThe final product was an interactive map that allows users to navigate either with or without a mouse, emphasizing the system's heightened accessibility and usability. The map also offers scalability, potentially expanding to incorporate more features or buildings in the future.\n\nWhile the project primarily served as a self-driven learning platform for new tools and techniques, its real-world applicability could significantly benefit both students and administrative staff. The lessons learned during the project, such as the importance of thorough planning, maintaining code quality, and consistent commenting, are invaluable and will guide future projects."
        }    ,
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-1-230",
            "title": "ChatGPT's Responces Reflect Student Misconceptions in Physics and Chemistry",
            "studentName": "Savanna Wheeler",
            "studentMajor": "CSSE",
            "projectType": "Individual Project: Student Defined",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/wheeler_sav.png",
            "abstract": "With many students turning to machine learning models such as ChatGPT for homework help, diagnosing the accuracy of the information these models purport across different fields is more important than ever. In this study, we tested ChatGPT using two exam inventories on topics in physics and chemistry to measure the accuracy and comparability to student answers of its responses. We performed both quantitative and qualitative data analysis on ChatGPT’s responses, to the ends of predicting the accuracy of its responses and analyzing the specific similarities or differences to student responses respectively. We found that ChatGPT’s responses to exam inventory questions are consistent with an accurate theoretical understanding of the tested areas, but are often incorrect when applied to a given system, reflecting many of the same misconceptions as students."
        }     ,
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-1-245",
            "title": "Developing an Intuitive Speech-Generating Device: A Personalized Approach for People with Autism Spectrum Disorder",
            "studentName": "Quan Trinh",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/trinh_quan_minh.png",
            "abstract": "Individuals who rely on Augmentative and Alternative Communication (AAC) devices often encounter challenges in communication, especially those who express themselves non-verbally. AAC devices supplement or provide an alternative mode of communication for non-verbal individuals. Our research project concentrated on developing a text-to-speech AAC application that is more intuitive and adaptable to each user's distinctive context and needs than commonly used applications. A primary focus for our work was to provide support for children and adults with Autism Spectrum Disorder (ASD), a neurodevelopmental condition often associated with unique patterns in social interaction and communication.\n\nAfter conducting usability research, the previous team discovered that personalizing AAC devices for individual users' daily activities presented challenges. Additionally, they identified a crucial need for an improved emergency feature in existing AAC devices. The team conducted design research and field observations to address these issues, gathering stakeholder feedback to create an initial design. This comprehensive research ultimately led to the development a low-fidelity Figma prototype of context adaptation and emergency function, which paved the way for the current team to implement higher-fidelity prototypes, such as an iOS prototype.\n\nThe research picked the iOS platform to create a working prototype because it is the most utilized platform for AAC devices. A working high-fidelity prototype is necessary because it accurately represents the final product and allows for user testing of its functionality and usability. Using a high-fidelity prototype, designers and developers can identify potential issues and make necessary changes before the final product is released. Additionally, a high-fidelity prototype can help stakeholders visualize the final product and provide valuable feedback early in development.\n\nOur research project aims to develop an intuitive AAC device that caters to the unique needs of users, especially children, and adults with ASD. We have made significant progress by creating high-fidelity prototypes. The future project team can further improve usability and personalization by surveying AAC users and conversation partners to comprehend better the user's context, routine, and situation. Then, the team can iterate upon the prototype and conduct user testing.  "
        }      ,
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-1-300",
            "title": "Developing an Intuitive Speech-Generating Device: A Personalized Approach for People with Autism Spectrum Disorder",
            "studentName": "Kirtiashna Chandra",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/chandra_kirtiashnas.jpg",
            "abstract": "Autism spectrum disorder (ASD) is a developmental disability that can result in difficulty in expressing via behavior, social interactions, and communication. Some autistic individuals are non-verbal and use Augmentative and Alternative Communication (AAC) devices to interact. Our research project focuses on individuals on the autism spectrum who communicate via text-to-speech AAC devices. Our goal is to further develop an intuitive AAC device that caters to the unique needs of users.\n\nFrom user research, a previous team discovered that AAC devices lacks personalization based on usage patterns and that they need improved emergency features. The former team went through a process that included research, design, prototyping, and field observations to address these concerns. Developmental progress combined with stakeholder feedback created an initial design which led to a low-fidelity prototype. This prototype included context adaptation based on usage pattern and emergency functions. This preliminary work allowed the current team to implement a higher-fidelity working prototype.\n\nTo understand more about context awareness and usage patterns, the current team put together a survey that will allow us to understand daily conversation routines and identify families who are willing to participate in a diary study. Before going ahead with Swift as our main programming language, we conducted a tech exploration to understand which language would produce a higher-fidelity prototype that best supports our goals. While my partner implemented emergency features and context adaptation using Swift, I worked on exploring and implementing SQLite databases that would hold different symbols, folders, and screens of the AAC application. I conducted technology research such as finding out what database platform to use, what middleware to use, and how to store images in the database. The implementation aspect included creating and populating the database as well as connecting it to our iOS project. The higher-fidelity prototype was implemented in iOS as this is the most common machine to have AAC devices on.\n\nThis is a multi-phase project which still has room for development. Both teams have made significant progress in terms of research and prototyping. The next step is launching the survey and eventually the diary study, implementing database functions, conducting usability tests, and further developing the prototype from insights. The end goal is to enrich communication between autistic individuals and anyone they converse with.\n\nThis is a multi-phase project which still has room for development. Both teams have made significant progress in terms of research and prototyping. The next step is launching the survey and eventually the diary study, implementing database functions, conducting usability tests, and further developing the prototype from insights. The end goal is to enrich communication between autistic individuals and anyone they converse with. "
        }       ,
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-1-315",
            "title": "Whimsy Walks- Neighborhood Art and Nature Walks Website",
            "studentName": "Marlin Banh",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/banh_marlin.jpg",
            "abstract": "Over the past 3 months, I have worked as the main developer on a sponsored project – Whimsy Walks, a project that provides the information about art sites and nature walks that neighborhood including Seattle, Bothell, and Kirkland. In this project, I had the chance to work with the founder of the project, stakeholder, and the UX team (IMD students). I was responsible for the front-end, back-end, and the database of the project.\n\nThe main purpose of this project is to create a website for people who want to explore the Whimsy Walks art sites and art walks. Website users can create their custom routes that they can follow to see the number of sites that they picked. This project encourages people to start the new hobby, which maintain a healthy weight, and prevent a variety of illness including heart disease, stroke, high block pressure, etc. This project also exposes people to artwork, which is known to stimulate the right hemisphere of the brain to develop the users’ creative thinking, imagination, empathy, and intuition.\n\nThe majority of the technical work was done using the Webflow tool to create the structure of the website. Besides that, I have applied my knowledge of HTML, CSS, and some libraries and frameworks of JavaScript (React.js, jQuery, etc.). I also extracted the data from the Google Map API to create the map that shows the locations of the art sites. As a result, I have finished the website with different end-user features including showing all the sites with their locations shown, providing information of each location, introducing the Whimsy Walks project to the users, generating the route between the users’ current location and the sites picked, and the method for the users to contact with the Whimsy Walks staffs.\n\nAfter working on this project, I have gained more knowledge and experience of working in the technical environment."
        }  
    ]
}